# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.
import os


def show_dir_this():
    print(os.listdir())


show_dir_this()
