# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4
input_variable = int(input('Input integer from 1 to 9 \n'))
while not (0 < input_variable < 10):
    input_variable = int(input('Uncorrect, Input integer \n'))
print(input_variable ** 2)
